Yueyang123/TencentOS/TecentOS_tiny/board/ALIENTEK_STM32F429/TOS-CONFIG/tos_config.h
#ifndef _TOS_CONFIG_H_
#define  _TOS_CONFIG_H_

#include "stm32f4xx.h"

//最大任务优先级
#define TOS_CFG_TASK_PRIO_MAX       10u

#define TOS_CFG_ROUND_ROBIN_EN      1u

#define TOS_CFG_OBJECT_VERIFY_EN       0u
//事件使能
#define TOS_CFG_EVENT_EN            1u

#define TOS_CFG_MMBLK_EN            1u

#define TOS_CFG_MMHEAP_EN           1u

#define TOS_CFG_MMHEAP_POOL_SIZE    0x6000

#define TOS_CFG_TASK_STACK_DRAUGHT_DEPTH_DETACT_EN  1u

#define TOS_CFG_MUTEX_EN            1u
//队列使能
#define TOS_CFG_QUEUE_EN            1u

#define TOS_CFG_TIMER_EN            1u

#define TOS_CFG_SEM_EN              1u

#define TOS_CFG_PWR_MGR_EN          0u

#define TOS_CFG_TICKLESS_EN         0u

#if (TOS_CFG_QUEUE_EN > 0u)
#define TOS_CFG_MSG_EN     1u
#else
#define TOS_CFG_MSG_EN     0u
#endif

#define TOS_CFG_VFS_EN              1u

#define TOS_CFG_MSG_POOL_SIZE           10u

#define TOS_CFG_IDLE_TASK_STK_SIZE      80u

//多少时钟滴答为1S
#define TOS_CFG_CPU_TICK_PER_SECOND     1000u

//每秒的时钟滴答
#define TOS_CFG_CPU_CLOCK               (SystemCoreClock)

#define TOS_CFG_TIMER_AS_PROC               1u

#endif

